Rayling35/STM32Cube_FW_L4_V1.12.0/Projects/32L496GDISCOVERY/Demonstrations/Core/Src/main.c
/**
  ******************************************************************************
  * @file    main.c 
  * @author  MCD Application Team
  * @brief   This file provides main program functions
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright 2017 STMicroelectronics International N.V. 
  * All rights reserved.</center></h2>
  *
  * Redistribution and use in source and binary forms, with or without 
  * modification, are permitted, provided that the following conditions are met:
  *
  * 1. Redistribution of source code must retain the above copyright notice, 
  *    this list of conditions and the following disclaimer.
  * 2. Redistributions in binary form must reproduce the above copyright notice,
  *    this list of conditions and the following disclaimer in the documentation
  *    and/or other materials provided with the distribution.
  * 3. Neither the name of STMicroelectronics nor the names of other 
  *    contributors to this software may be used to endorse or promote products 
  *    derived from this software without specific written permission.
  * 4. This software, including modifications and/or derivative works of this 
  *    software, must execute solely and exclusively on microcontroller or
  *    microprocessor devices manufactured by or for STMicroelectronics.
  * 5. Redistribution and use of this software other than as permitted under 
  *    this license is void and will automatically terminate your rights under 
  *    this license. 
  *
  * THIS SOFTWARE IS PROVIDED BY STMICROELECTRONICS AND CONTRIBUTORS "AS IS" 
  * AND ANY EXPRESS, IMPLIED OR STATUTORY WARRANTIES, INCLUDING, BUT NOT 
  * LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY, FITNESS FOR A 
  * PARTICULAR PURPOSE AND NON-INFRINGEMENT OF THIRD PARTY INTELLECTUAL PROPERTY
  * RIGHTS ARE DISCLAIMED TO THE FULLEST EXTENT PERMITTED BY LAW. IN NO EVENT 
  * SHALL STMICROELECTRONICS OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT,
  * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT
  * LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, 
  * OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF 
  * LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING 
  * NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,
  * EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/
#include "main.h" 

#include "stm32l4xx_ll_bus.h" 



extern void I2C2_DeInit(void);

/** @addtogroup CORE
  * @{
  */

/** @defgroup MAIN
* @brief main file
* @{
*/ 

/** @defgroup MAIN_Private_TypesDefinitions
* @{
*/ 

typedef  void (*pFunc)(void);

/**
* @}
*/ 

/** @defgroup MAIN_Private_Defines
* @{
*/ 
#if defined(DIM_FEATURE_ENABLED)
/*
    To configure the screen dimming timer to 7s, the WakeUpCounter is set to 0x36B0:
    Wakeup Time Base = 16 /(~32.000KHz) = ~0.5 ms
    Wakeup Time = 0.5 ms  * WakeUpCounter
    Therefore, with wake-up counter = 0x36B0 = 14000  
       Wakeup Time =  ~ 0,5 ms * 14000  ~ 7 sec. 
  */
#define DIMMING_TIMER_DELAY        ((uint32_t)0x036B0)

/* Optional delay to slow down the dimming transition.
   Not used (set to 0x00) in the demonstration software */
#define DIMMING_DELAY        ((uint32_t)0x00)

#endif



/**
* @}
*/ 


/** @defgroup MAIN_Private_Macros
* @{
*/ 
/**
* @}
*/ 


/** @defgroup MAIN_Private_Variables
* @{
*/
#if defined(DIM_FEATURE_ENABLED)
uint32_t dimming_timer_to_start     = 1;
uint32_t dimming_enable             = 0;
uint32_t dimming_complete           = 0;
RTC_HandleTypeDef Dim_RTCHandle;

extern uint32_t video_playing;
extern uint32_t dimming_on; 
/* Timer handler declaration */
extern TIM_HandleTypeDef    LCD_TimHandle;  
/* Timer Output Compare Configuration Structure declaration */
extern TIM_OC_InitTypeDef LCD_sConfig;  
#endif
extern uint32_t iddTestIndex;
uint32_t low_power_mode_forbidden   = 0;

/* Flags used to recover Idd measurements results from Standby or Shutdown mode */
FlagStatus Fetch_IddResults = RESET;
FlagStatus Simulate_SecondPress = RESET;

/* Flag to indicate whether or not software is coming back from a software reset */
uint32_t software_reset_flag = 0;
/* Flag to indicate user-requested TouchScreen calibration at start-up */
uint32_t joystick_press = 0;
int sd_status = 0;
/**
* @}
*/ 


/** @defgroup MAIN_Private_FunctionPrototypes
* @{
*/ 
#if defined(DIM_FEATURE_ENABLED)
static void DimRTC_Config(void);
static void LCD_ScreenDimmingOn_AdHoc(void);
#endif
static void GUIThread(void const * argument);
static void SystemClock_Decrease(void);
static void DeInit_Before_LPSleepMode(void);
static void ReInit_After_LPSleepMode(void);

extern K_ModuleItem_Typedef  STemWin_board;
extern K_ModuleItem_Typedef  EW_board;
extern K_ModuleItem_Typedef  TGFX_board;
extern K_ModuleItem_Typedef  TGFX_FULL_board;

extern K_ModuleItem_Typedef  video_player_board;
extern K_ModuleItem_Typedef  audio_player_board;
extern K_ModuleItem_Typedef  audio_recorder_board;
extern K_ModuleItem_Typedef  INFORMATION_board;
extern K_ModuleItem_Typedef  USB_Storage_board;
extern K_ModuleItem_Typedef  idd_measure_board;
extern K_ModuleItem_Typedef  analog_clock_board;
extern K_ModuleItem_Typedef  return_board;

uint8_t ucHeap[ configTOTAL_HEAP_SIZE ];


/**
* @}
*/ 

/** @defgroup MAIN_Private_Functions
* @{
*/ 

/**
* @brief  Main program
* @param  None
* @retval int
*/
int main(void)
{  
  static __IO uint32_t thirdPartyAdress;

  __HAL_RCC_PWR_CLK_ENABLE();

   /* Enable RTC back-up registers access */
  HAL_PWR_EnableBkUpAccess();
  
  thirdPartyAdress = READ_REG(RTC->BKP30R);
  if (thirdPartyAdress != 0)
  {
    WRITE_REG(RTC->BKP30R, 0);
    /* Reinitialize the Stack pointer*/
    __set_MSP(*(__IO uint32_t*) thirdPartyAdress);
    /* Jump to application address */  
    ((pFunc) (*(__IO uint32_t*) (thirdPartyAdress + 4)))();
  }  

  /* STM32L4xx HAL library initialization:
   - Configure the Flash prefetch, instruction and Data caches
   - Configure the Systick to generate an interrupt each 1 msec
   - Set NVIC Group Priority to 4
   - Global MSP (MCU Support Package) initialization
  */
  HAL_Init();

  /* Configure the system clock to 80 MHz */
  SystemClock_Config();

  __HAL_RCC_PWR_CLK_ENABLE();

