Rayling35/STM32Cube_FW_L4_V1.12.0/Projects/32L496GDISCOVERY/Demonstrations/Core/Src/main.c
  if (__HAL_PWR_GET_FLAG(PWR_FLAG_SB) != RESET)
  {
    WakeUpFromStandby = SET;
  }
  else
  {
    WakeUpFromStandby = RESET;
  }  
    
  /* Check whether or not coming back from a software reset.
     Used to avoid displaying ST logo again */
  software_reset_flag = READ_REG(RTC->BKP27R);
  WRITE_REG(RTC->BKP27R, 1);

#if defined(DIM_FEATURE_ENABLED)
  DimRTC_Config();
#endif
  
  /* Enable USB power on Pwrctrl CR2 register */
  HAL_PWREx_EnableVddUSB();
  
   /* Enable RTC back-up registers access */
  HAL_PWR_EnableBkUpAccess();

  /* Check if the system was resumed from shutdown mode,
     resort to RTC back-up register RTC_BKP31R to verify 
     whether or not shutdown entry flag was set by software
     before entering shutdown mode.  */
  if (READ_REG(RTC->BKP31R) == 1)
  {
    WakeUpFromShutdown = SET;
  }
  else
  {
    WakeUpFromShutdown = RESET;
  }   
  
  /* Initialize Joystick, Touch screen and Leds */
  BSP_JOY_Init(JOY_MODE_GPIO);
  k_BspInit();
  
  /* Initializes backup domain */
  k_CalendarBkupInit();  
  
  /* Create GUI task */
  osThreadDef(GUI_Thread, GUIThread, osPriorityNormal, 0, 4096);
  osThreadCreate (osThread(GUI_Thread), NULL); 
  
  /* Add Modules*/
  k_ModuleInit();
  
  k_ModuleAdd(&STemWin_board);
  k_ModuleAdd(&EW_board);
  k_ModuleAdd(&TGFX_board);
  k_ModuleAdd(&TGFX_FULL_board);
  
  
  k_ModuleAdd(&video_player_board);
  k_ModuleAdd(&audio_player_board);
  k_ModuleAdd(&audio_recorder_board);  
  k_ModuleAdd(&INFORMATION_board);
  
  k_ModuleAdd(&USB_Storage_board);
  k_ModuleAdd(&idd_measure_board);
  k_ModuleAdd(&analog_clock_board);
  k_ModuleAdd(&return_board);  
  
  /* Initialize GUI */
  GUI_Init();  
  
  /* Enable memory devices */
  WM_SetCreateFlags(WM_CF_MEMDEV);  
  
  /* Set General Graphical proprieties */
  k_SetGuiProfile();
  
  GUI_X_InitOS();

  /* Initialize MFX interrupt manager */
  k_MfxInit();  
  
  /* Check whether or not joystick SEL button is pressed
     at start-up (if yes, triggers a user-requested
     Touch Screen calibration) */
  if (BSP_JOY_GetState() == JOY_SEL)
  {
    joystick_press = 1;  
  }
  /* De-initialize joystick (not used anymore) */
  BSP_JOY_DeInit();
  
  /* Start scheduler */
  osKernelStart();

  /* We should never get here as control is now taken by the scheduler */
  for( ;; );
}


/**
  * @brief  SD detect callback
  * @param  None
  * @retval None
  */ 
void HAL_GPIO_EXTI_Callback(uint16_t GPIO_Pin)
{
  /* IT comming from MFX */
  if(GPIO_Pin == MFX_INT_PIN) 
  {
    
    if((sd_status == 1) && (WakeUpFromStandby == RESET) && (WakeUpFromShutdown == RESET))
    {
          /* Check if the SD card is plugged in the slot */
    if(k_StorageGetStatus (MSD_DISK_UNIT) == 0)
    {
        BSP_IO_ConfigPin(SD_DETECT_PIN, IO_MODE_IT_RISING_EDGE_PU); 
        osMessagePut ( StorageEvent, MSDDISK_CONNECTION_EVENT, 0); 
        sd_status = 0; 
      }
    else
    {
      BSP_IO_ConfigPin(SD_DETECT_PIN, IO_MODE_IT_FALLING_EDGE_PU);
      osMessagePut ( StorageEvent, MSDDISK_DISCONNECTION_EVENT, 0); 
      sd_status = 0;
    } 
    }
    else
    {    
    
    
#if defined(DIM_FEATURE_ENABLED)
     dimming_timer_to_start = 1;
     dimming_complete = 0;
     dimming_enable = 0;        
     BSP_LCD_ScreenDimmingOff(); 
     HAL_RTCEx_DeactivateWakeUpTimer(&Dim_RTCHandle);
#endif
    osMessagePut (MfxEvent, MFX_INTERRUPT_EVENT, 0);
  }
  }
  /* IT comming from TS */
  if(GPIO_Pin == TS_INT_PIN) 
  {
#if defined(DIM_FEATURE_ENABLED)
     dimming_timer_to_start = 1;
     dimming_complete = 0;
     dimming_enable = 0;       
     BSP_LCD_ScreenDimmingOff();
     HAL_RTCEx_DeactivateWakeUpTimer(&Dim_RTCHandle);
#endif
     osMessagePut (MfxEvent, TS_INTERRUPT_EVENT, 0);
  }
  
}


#if defined(DIM_FEATURE_ENABLED)
void HAL_RTCEx_WakeUpTimerEventCallback(RTC_HandleTypeDef *hrtc)
{
  dimming_enable = 1;  
  HAL_RTCEx_DeactivateWakeUpTimer(&Dim_RTCHandle);
}  
#endif

/**
  * @brief  Start task
  * @param  argument: pointer that is passed to the thread function as start argument.
  * @retval None
  */
static void GUIThread(void const * argument)
{  
  if(TouchScreen_IsCalibrationDone() == 0)
  {
    Touchscreen_Calibration();
  }

  /* Enable TS interrupt */
  if (BSP_TS_ITConfig() != TS_OK) {
    Error_Handler();
  }
  
  if (software_reset_flag == 0)
  {
    /* Demo Startup */
    k_StartUp();   
  }
  
  /* Initialize Storage Units */
  k_StorageInit(); 
  
  /* Show the main menu */
  k_InitMenu();
  
  /* Gui background Task */
  while(1) {
    GUI_Exec(); /* Do the background work ... Update windows etc.) */   
    
#if defined(DIM_FEATURE_ENABLED)
    /* If dimming timer is authorized to start and video player is not running,
       start the timer */
    if ((dimming_timer_to_start == 1) && (video_playing == 0))
    {
      HAL_RTCEx_SetWakeUpTimer_IT(&Dim_RTCHandle, DIMMING_TIMER_DELAY, RTC_WAKEUPCLOCK_RTCCLK_DIV16);
      dimming_timer_to_start = 0;
    }
    if (dimming_enable == 1)
    {
      LCD_ScreenDimmingOn_AdHoc();       
    }
#endif
    
    if (Fetch_IddResults != RESET)
    {
      static GUI_PID_STATE TS_State = {0, 0, 0, 0};

      TS_State.x = 180;
      TS_State.y = 180;     
      TS_State.Pressed = 1;

      Fetch_IddResults = RESET;
             
      /* Emulate a touch on the IDD Measure icon */
      GUI_TOUCH_StoreStateEx(&TS_State);
      osMessagePut (MfxEvent, TS_INTERRUPT_EVENT, 0);      
      
    }    
    else if ((WakeUpFromStandby != RESET) || (WakeUpFromShutdown != RESET))
    {  
      static GUI_PID_STATE TS_State = {0, 0, 0, 0};

      TS_State.x = 0;
      TS_State.y = 0;      
      TS_State.Pressed = 1;

      Simulate_SecondPress = SET;
      /* Emulate a touch on STemWin Menu icon */
      GUI_TOUCH_StoreStateEx(&TS_State);
      osMessagePut (MfxEvent, TS_INTERRUPT_EVENT, 0);
    }
    
    osDelay(20); /* Nothing left to do for the moment ... Idle processing */

