Rayling35/STM32Cube_FW_L4_V1.12.0/Projects/32L496GDISCOVERY/Demonstrations/Core/Src/main.c
}

/**
  * @brief  System Low Power Configuration
  * @param  Mode: Purpose of HW deinitialization 
   *              (HWINIT_ERROR/HWINIT_STARTUP/HWINIT_IDD/HWINIT_STOP2/HWINIT_STANDBY)
  
  * @retval None
  */
void SystemHardwareDeInit(HwInitMode Mode)
{
  RCC_OscInitTypeDef oscinitstruct = {0};
  GPIO_InitTypeDef GPIO_InitStructure;

  k_CalendarBkupDeInit();
  
  LL_AHB1_GRP1_DisableClock(LL_AHB1_GRP1_PERIPH_DMA2D); 
#if defined(DIM_FEATURE_ENABLED) 
  TIMx_CLK_DISABLE();
#endif
  
  BSP_QSPI_DeInit();
  
  BSP_LED_DeInit(LED_ORANGE);

  BSP_LED_DeInit(LED_GREEN);
  
  /* Enable PWR  peripheral Clock */
  __HAL_RCC_PWR_CLK_ENABLE();

  HAL_PWREx_DisablePullUpPullDownConfig();

  HAL_PWR_DisableBkUpAccess();

  HAL_PWREx_DisableVddIO2();

  /* All Clock off instead of in all modes */
  oscinitstruct.OscillatorType = RCC_OSCILLATORTYPE_LSE | RCC_OSCILLATORTYPE_LSI | RCC_OSCILLATORTYPE_HSE | RCC_OSCILLATORTYPE_HSI | RCC_OSCILLATORTYPE_HSI48;
  oscinitstruct.PLL.PLLState   = RCC_PLL_NONE;
  
  if(HAL_RCC_OscConfig(&oscinitstruct) != HAL_OK)
  {
    Error_Handler();
  }

  /* Deinit I2C but keep MFX out IRQ available */
  I2C2_DeInit();

  /* Enable GPIOs clock */
  __HAL_RCC_GPIOA_CLK_ENABLE();
  __HAL_RCC_GPIOB_CLK_ENABLE();
  __HAL_RCC_GPIOC_CLK_ENABLE();
  __HAL_RCC_GPIOD_CLK_ENABLE();
  __HAL_RCC_GPIOE_CLK_ENABLE();
  __HAL_RCC_GPIOF_CLK_ENABLE();
  __HAL_RCC_GPIOG_CLK_ENABLE();
  __HAL_RCC_GPIOH_CLK_ENABLE();
  __HAL_RCC_GPIOI_CLK_ENABLE();
  
  /* Set all GPIO in analog state to reduce power consumption                 */
  /* Note: Debug using ST-Link is not possible during the execution of this   */
  /*       example because communication between ST-link and the device       */
  /*       under test is done through UART. All GPIO pins are disabled (set   */
  /*       to analog input mode) including  UART I/O pins.           */
  GPIO_InitStructure.Pin = GPIO_PIN_All;
  GPIO_InitStructure.Mode = GPIO_MODE_ANALOG;
  GPIO_InitStructure.Pull = GPIO_NOPULL;

  /* keep swdio swclk */
  HAL_GPIO_Init(GPIOA, &GPIO_InitStructure); 
  
  GPIO_InitStructure.Pin = GPIO_PIN_All;
  HAL_GPIO_Init(GPIOB, &GPIO_InitStructure);

  /* keep mfx wakeup pin */
  GPIO_InitStructure.Pin = (GPIO_PIN_All & ~(MFX_INT_PIN));
  HAL_GPIO_Init(GPIOC, &GPIO_InitStructure);

  GPIO_InitStructure.Pin = GPIO_PIN_All;
  HAL_GPIO_Init(GPIOD, &GPIO_InitStructure); 
  HAL_GPIO_Init(GPIOE, &GPIO_InitStructure);
  HAL_GPIO_Init(GPIOF, &GPIO_InitStructure); 
  HAL_GPIO_Init(GPIOG, &GPIO_InitStructure);    
  
  /* Keep LCD power on */
  GPIO_InitStructure.Pin = (GPIO_PIN_All & ~(LCD_PWR_CTRL_PIN));
  HAL_GPIO_Init(GPIOH, &GPIO_InitStructure);

  if (iddTestIndex == 0)
  {
    /* in Run mode, keep LCD on during measurement */
    GPIO_InitStructure.Pin = (GPIO_PIN_All & ~(LCD_BL_CTRL_PIN));  
  }
  else
  {
    GPIO_InitStructure.Pin = GPIO_PIN_All;
  }
  HAL_GPIO_Init(GPIOI, &GPIO_InitStructure);

  /* Disable GPIOs clock */
  __HAL_RCC_GPIOA_CLK_DISABLE();
  __HAL_RCC_GPIOB_CLK_DISABLE();
  __HAL_RCC_GPIOC_CLK_DISABLE();
  __HAL_RCC_GPIOD_CLK_DISABLE();
  __HAL_RCC_GPIOE_CLK_DISABLE();
  __HAL_RCC_GPIOF_CLK_DISABLE();  
  __HAL_RCC_GPIOG_CLK_DISABLE();  
  __HAL_RCC_GPIOH_CLK_DISABLE();
  __HAL_RCC_GPIOI_CLK_DISABLE();  
}




/**
  * @brief  Enable System peripheral clocks
  * @retval None
  */
void SystemPeripheralClockEnable(void)
{
  /* Enable minimum System peripheral clocks */
  /* others will be enabled via BSP layers   */
  __HAL_RCC_FLASH_CLK_ENABLE();
  __HAL_RCC_SYSCFG_CLK_ENABLE();
  __HAL_RCC_GPIOA_CLK_ENABLE();
  __HAL_RCC_GPIOB_CLK_ENABLE();
  __HAL_RCC_GPIOC_CLK_ENABLE();
  __HAL_RCC_GPIOD_CLK_ENABLE();
  __HAL_RCC_GPIOE_CLK_ENABLE();
  __HAL_RCC_GPIOF_CLK_ENABLE();
  __HAL_RCC_GPIOG_CLK_ENABLE();
  __HAL_RCC_GPIOH_CLK_ENABLE();
  __HAL_RCC_GPIOI_CLK_ENABLE();
  
  __HAL_RCC_I2C1_CLK_ENABLE();
  __HAL_RCC_SPI2_CLK_ENABLE();
  __HAL_RCC_DFSDM1_CLK_ENABLE();
  __HAL_RCC_DMA1_CLK_ENABLE();
  __HAL_RCC_DMA2_CLK_ENABLE();
  __HAL_RCC_DMA2D_CLK_ENABLE();    
  __HAL_RCC_TIM6_CLK_ENABLE();
  __HAL_RCC_FMC_CLK_ENABLE();
  __HAL_RCC_PWR_CLK_ENABLE();
  __HAL_RCC_SAI1_CLK_ENABLE();
  __HAL_RCC_DFSDM1_CLK_ENABLE();
  __HAL_RCC_DCMI_CLK_ENABLE();  
  __HAL_RCC_QSPI_CLK_ENABLE();
  __HAL_RCC_SDMMC1_CLK_ENABLE();
  __HAL_RCC_RTC_ENABLE();    
}

/**
  * @brief  Disable System peripheral clocks
  * @retval None
  */
void SystemPeripheralClockDisable(void)
{
  GPIO_InitTypeDef GPIO_InitStructure;  
  
   
   /* Enable GPIOs clock */
  __HAL_RCC_GPIOA_CLK_ENABLE();
  __HAL_RCC_GPIOB_CLK_ENABLE();
  __HAL_RCC_GPIOC_CLK_ENABLE();
  __HAL_RCC_GPIOD_CLK_ENABLE();
  __HAL_RCC_GPIOE_CLK_ENABLE();
  __HAL_RCC_GPIOF_CLK_ENABLE();
  __HAL_RCC_GPIOG_CLK_ENABLE();
  __HAL_RCC_GPIOH_CLK_ENABLE();
  __HAL_RCC_GPIOI_CLK_ENABLE();  
  
  /* Set all GPIO in analog state to reduce power consumption */  
  GPIO_InitStructure.Mode = GPIO_MODE_ANALOG;
  GPIO_InitStructure.Pull = GPIO_NOPULL;  
  
  GPIO_InitStructure.Pin = (GPIO_PIN_All & ~((GPIO_PIN_3 | GPIO_PIN_6 | GPIO_PIN_7)));    
  HAL_GPIO_Init(GPIOA, &GPIO_InitStructure);  
  GPIO_InitStructure.Pin = (GPIO_PIN_All & ~((GPIO_PIN_0 | GPIO_PIN_1 |GPIO_PIN_11)));    
  HAL_GPIO_Init(GPIOB, &GPIO_InitStructure);  
  GPIO_InitStructure.Pin = (GPIO_PIN_All & ~(MFX_INT_PIN));
  HAL_GPIO_Init(GPIOC, &GPIO_InitStructure); 
  
  GPIO_InitStructure.Pin = GPIO_PIN_All; 
  HAL_GPIO_Init(GPIOD, &GPIO_InitStructure);   
  HAL_GPIO_Init(GPIOE, &GPIO_InitStructure);   
  HAL_GPIO_Init(GPIOF, &GPIO_InitStructure);   
  GPIO_InitStructure.Pin = (GPIO_PIN_All & ~(TS_INT_PIN));    
  HAL_GPIO_Init(GPIOG, &GPIO_InitStructure);  
  GPIO_InitStructure.Pin = (GPIO_PIN_All & ~(LCD_PWR_CTRL_PIN));  
  HAL_GPIO_Init(GPIOH, &GPIO_InitStructure);   
  GPIO_InitStructure.Pin = (GPIO_PIN_All & ~(LCD_BL_CTRL_PIN));    
  HAL_GPIO_Init(GPIOI, &GPIO_InitStructure);   

