Rayling35/STM32Cube_FW_L4_V1.12.0/Projects/32L496GDISCOVERY/Demonstrations/Core/Src/main.c
  /* Disable remaining clocks */
  __HAL_RCC_FLASH_CLK_DISABLE();
  __HAL_RCC_SYSCFG_CLK_DISABLE();
  __HAL_RCC_GPIOA_CLK_DISABLE();
  __HAL_RCC_GPIOB_CLK_DISABLE();
  __HAL_RCC_GPIOC_CLK_DISABLE();
  __HAL_RCC_GPIOD_CLK_DISABLE();
  __HAL_RCC_GPIOE_CLK_DISABLE();
  __HAL_RCC_GPIOF_CLK_DISABLE();
  __HAL_RCC_GPIOG_CLK_DISABLE();
  __HAL_RCC_GPIOH_CLK_DISABLE();
  __HAL_RCC_GPIOI_CLK_DISABLE();
  __HAL_RCC_I2C1_CLK_DISABLE();
  __HAL_RCC_SPI2_CLK_DISABLE();
  __HAL_RCC_DFSDM1_CLK_DISABLE();
  __HAL_RCC_DMA1_CLK_DISABLE();
  __HAL_RCC_DMA2_CLK_DISABLE();
  __HAL_RCC_DMA2D_CLK_DISABLE();  
  __HAL_RCC_TIM6_CLK_DISABLE();
  __HAL_RCC_FMC_CLK_DISABLE();
  __HAL_RCC_PWR_CLK_DISABLE();
  __HAL_RCC_SAI1_CLK_DISABLE();
  __HAL_RCC_DFSDM1_CLK_DISABLE();
  __HAL_RCC_DCMI_CLK_DISABLE();  
  __HAL_RCC_QSPI_CLK_DISABLE();
  __HAL_RCC_SDMMC1_CLK_DISABLE();
  __HAL_RCC_RTC_DISABLE();  
  
  
  RCC->AHB1SMENR  = 0x0;
  RCC->AHB2SMENR  = 0x0;
  RCC->AHB3SMENR  = 0x0;
  RCC->APB1SMENR1 = 0x08;  /* TIM5 maintained in LP Sleep mode */
  RCC->APB1SMENR2 = 0x0;
  RCC->APB2SMENR  = 0x0;
}


/**
  * @brief  DeInit peripherals and clocks before entering Low Power Sleep Mode
  * @param  None  
  * @retval None
  */
static void DeInit_Before_LPSleepMode(void)
{
  /* Disable all threads in order block rescheduling after wake up */
  vTaskSuspendAll();
       
  k_CalendarBkupDeInit();
    
  /* I2C2 deinit */
  I2C2_DeInit();
  
  BSP_QSPI_DeInit();
  
  /* MSP deinit FMC */
  FMC_BANK1_MspDeInit();
  
  SystemPeripheralClockDisable();
  
  SystemClock_Decrease();
  
  HAL_PWREx_DisablePullUpPullDownConfig();
  HAL_PWR_DisableBkUpAccess();  
  HAL_PWREx_DisableVddIO2();     
  
  HAL_SuspendTick();
  /* Suspend RTOS Systick */
  CLEAR_BIT(SysTick->CTRL, SysTick_CTRL_ENABLE_Msk);
}


/**
  * @brief  ReInit peripherals and clocks after exiting Low Power Sleep Mode
  * @param  None
  * @retval None
  */
static void ReInit_After_LPSleepMode(void)
{
  /* At wake-up, first disable Low Power Run Mode */
  HAL_PWREx_DisableLowPowerRunMode();    
  SystemClock_Config();

   HAL_ResumeTick();
  /* Resume RTOS Systick */
  SET_BIT(SysTick->CTRL, SysTick_CTRL_ENABLE_Msk);   
    
  SystemPeripheralClockEnable();
  
  HAL_PWREx_EnableVddIO2();
  HAL_PWR_EnableBkUpAccess();
  HAL_PWREx_EnablePullUpPullDownConfig();
  
  /* MSP init FMC */
  FMC_BANK1_MspInit();

  /* I2C2 Init */
  I2C2_Init();      
  
   k_BspInit();

  BSP_TS_InitEx(BSP_LCD_GetXSize(), BSP_LCD_GetYSize(), BSP_LCD_GetOrientation());  

  /* Enable TS interrupt */
  if (BSP_TS_ITConfig() != TS_OK) {
    Error_Handler();
  }
  k_CalendarBkupInit();
  /* Enable all threads in order block rescheduling after wake up */
  xTaskResumeAll();
}


/**
  * @brief  This function is executed in case of error occurrence.
  * @param  None
  * @retval None
  */
void Error_Handler(void)
{
    /* Init Error Led Orange */
    BSP_LED_Init(LED_ORANGE);
    /* Turn Led Orange on */
    BSP_LED_On(LED_ORANGE);
    while(1);
}


/**
  * @brief  This function is executed to enter MCU in STOP2 mode
  * @param  None
  * @retval None
  */
void EnterStop2Mode(void)
{
#if (PREFETCH_ENABLE != 0)
  /* Disable Prefetch Buffer */
  __HAL_FLASH_PREFETCH_BUFFER_DISABLE();
#endif /* PREFETCH_ENABLE */

  /* Ensure that MSI is wake-up system clock */ 
  HAL_RCCEx_WakeUpStopCLKConfig(RCC_STOP_WAKEUPCLOCK_MSI);

  /* Enable PWR clock enable */
  __HAL_RCC_PWR_CLK_ENABLE();
  
  HAL_PWREx_DisableLowPowerRunMode();

  /* Suspend HAL tick interrupt */
  HAL_SuspendTick();

  /* Suspend RTOS Systick */
  CLEAR_BIT(SysTick->CTRL, SysTick_CTRL_ENABLE_Msk);

  /* System peripheral clock disable */
  SystemPeripheralClockDisable();

  /* Enable PWR clock enable */
  __HAL_RCC_PWR_CLK_ENABLE();
  
  /* Enter in Low power Stop 2 */
  HAL_PWREx_EnterSTOP2Mode(PWR_STOPENTRY_WFI);
}

/**
  * @brief  This function is executed when MCU exits from STOP2 mode
  * @param  None
  * @retval None
  */
void ExitStop2Mode(void)
{
#if (PREFETCH_ENABLE != 0)
  /* Re-enable Prefetch Buffer */
  __HAL_FLASH_PREFETCH_BUFFER_ENABLE();
#endif /* PREFETCH_ENABLE */

  /* System peripheral clock enable */
  SystemPeripheralClockEnable();
  
  /* Resume HAL tick interrupt */
  HAL_ResumeTick();
  
  /* Resume RTOS Systick */
  SET_BIT(SysTick->CTRL, SysTick_CTRL_ENABLE_Msk);

  /* Disable Power Control clock */
  __HAL_RCC_PWR_CLK_DISABLE();

  /* Restore clock to default frequency when not running on battery */
  SystemClock_Config();
}



/**
  * @brief  System Clock Speed decrease
  *         The system Clock source is shifted from HSI to MSI
  *         while at the same time, MSI range is set to RCC_MSIRANGE_3
  *         to go down to 800 KHz     
  * @param  None
  * @retval None
  */
static void SystemClock_Decrease(void)
{
  RCC_ClkInitTypeDef RCC_ClkInitStruct = {0};
  RCC_OscInitTypeDef RCC_OscInitStruct = {0};

  /* MSI is enabled after System reset, activate PLL with MSI as source */
  RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_MSI;
  RCC_OscInitStruct.HSEState = RCC_HSE_OFF;
  RCC_OscInitStruct.HSIState = RCC_HSI_ON;
  RCC_OscInitStruct.MSIState = RCC_MSI_ON;
  RCC_OscInitStruct.MSIClockRange = RCC_MSIRANGE_3;
  RCC_OscInitStruct.MSICalibrationValue = RCC_MSICALIBRATION_DEFAULT;
  RCC_OscInitStruct.PLL.PLLState = RCC_PLL_NONE;
  if(HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK)
  {
    /* Initialization Error */
    Error_Handler();
  }
  
  /* Select MSI as system clock source and configure the HCLK, PCLK1 and PCLK2 
     clocks dividers */
  RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_SYSCLK;
  RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_MSI; 
  RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
  RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV1;  
  RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV1;
  if(HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_0) != HAL_OK)
  {
    /* Initialization Error */
    Error_Handler();
  }
  
