Rayling35/STM32Cube_FW_L4_V1.12.0/Projects/32L496GDISCOVERY/Demonstrations/Core/Src/main.c
}

#if defined(DIM_FEATURE_ENABLED)
static void DimRTC_Config(void)
{

  /* Configure RTC */
  Dim_RTCHandle.Instance = RTC;
  /* Set the RTC time base to 1s */
  /* Configure RTC prescaler and RTC data registers as follow:
    - Hour Format = Format 24
    - Asynch Prediv = Value according to source clock
    - Synch Prediv = Value according to source clock
    - OutPut = Output Disable
    - OutPutPolarity = High Polarity
    - OutPutType = Open Drain */
  Dim_RTCHandle.Init.HourFormat = RTC_HOURFORMAT_24;
  Dim_RTCHandle.Init.AsynchPrediv = 0x7F /*RTC_ASYNCH_PREDIV*/;
  Dim_RTCHandle.Init.SynchPrediv = 0xF9 /*RTC_SYNCH_PREDIV*/;
  Dim_RTCHandle.Init.OutPut = RTC_OUTPUT_DISABLE;
  Dim_RTCHandle.Init.OutPutPolarity = RTC_OUTPUT_POLARITY_HIGH;
  Dim_RTCHandle.Init.OutPutType = RTC_OUTPUT_TYPE_OPENDRAIN;
  if(HAL_RTC_Init(&Dim_RTCHandle) != HAL_OK)
  {
    /* Initialization Error */
    while(1);
  }
  
    HAL_NVIC_SetPriority(RTC_WKUP_IRQn, 0x0, 0);
  HAL_NVIC_EnableIRQ(RTC_WKUP_IRQn);
}


/**
  * @brief  LCD screen dimming enable
  * @note   Screen brightness is gradually decreased.
  *         API inspired from BSP_LCD_ScreenDimmingOn() modified
  *         to prevent MMI freeze during dimming.    
  * @param  None
  * @retval None
  */
static void LCD_ScreenDimmingOn_AdHoc(void)
{
  /* Counter Prescaler value */
  uint32_t uhPrescalerValue = 0;

  static uint32_t i = 0; 
  
  
  /* Set that dim feature is active */
  if (dimming_on ==0 )
  {
    dimming_on = 1;
    i = PULSE_DECREASE_START;
  

    /* Always redo the full initialization as there is no apriori knowledge
      of IO or timer settings at this point (may have been modified by application) */
    
    /* Compute the prescaler value to have TIM1 counter clock equal to 16000000 Hz */
    uhPrescalerValue = (uint32_t)(SystemCoreClock / 16000000) - 1;  
  
    LCD_TimHandle.Instance = TIMx;

    __HAL_TIM_RESET_HANDLE_STATE(&LCD_TimHandle); /* to force MSP call */
    LCD_TimHandle.Init.Prescaler         = uhPrescalerValue;
    LCD_TimHandle.Init.Period            = PERIOD_VALUE;
    LCD_TimHandle.Init.ClockDivision     = 0;
    LCD_TimHandle.Init.CounterMode       = TIM_COUNTERMODE_UP;
    LCD_TimHandle.Init.RepetitionCounter = 0;
    if (HAL_TIM_PWM_Init(&LCD_TimHandle) != HAL_OK)
    {
      /* Initialization Error */
      while(1);
    }  
  
    /* Common configuration for all channels */
    LCD_sConfig.OCMode       = TIM_OCMODE_PWM1;
    LCD_sConfig.OCPolarity   = TIM_OCPOLARITY_HIGH;
    LCD_sConfig.OCFastMode   = TIM_OCFAST_DISABLE;
    LCD_sConfig.OCNPolarity  = TIM_OCNPOLARITY_HIGH;
    LCD_sConfig.OCNIdleState = TIM_OCNIDLESTATE_RESET;
    
    LCD_sConfig.OCIdleState  = TIM_OCIDLESTATE_RESET;

    /* Set the pulse value for channel */
    LCD_sConfig.Pulse = PULSE_DECREASE_START;
    if (HAL_TIM_PWM_ConfigChannel(&LCD_TimHandle, &LCD_sConfig, TIMx_CHANNEL) != HAL_OK)
    {
      /* Configuration Error */
      while(1);
    }
  
  
    /* Start Timer channel */
    if (HAL_TIM_PWM_Start(&LCD_TimHandle, TIMx_CHANNEL) != HAL_OK)
    {
      /* PWM Generation Error */
      while(1);
    }
  
  }
  else
  {
    i--;
  }
    
  /* Set the pulse value for the timer channel */
   
  __HAL_TIM_SET_COMPARE(&LCD_TimHandle, TIMx_CHANNEL, i);
  HAL_Delay(DIMMING_DELAY);

  if (i == PULSE_VALUE)
  {
        dimming_enable = 0;
        dimming_complete = 1;
  }  
}

#endif

#ifdef USE_FULL_ASSERT
/**
* @brief  assert_failed
*         Reports the name of the source file and the source line number
*         where the assert_param error has occurred.
* @param  File: pointer to the source file name
* @param  Line: assert_param error line source number
* @retval None
*/
void assert_failed(char *file, uint32_t line)
{
  /* User can add his own implementation to report the file name and line
  number,ex: printf("Wrong parameters value: file %s on line %d\r\n", 
  file, line) */
  
  /* Infinite loop */
  while (1)
  {}
}

#endif


/**
* @}
*/ 

/**
* @}
*/ 

/**
* @}
*/ 

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
